app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def create
    @pessoa = Pessoa.new(pessoa_params)

    if @pessoa.save
---
INSERT INTO "pessoas" ("nome", "data_nascimento", "rg", "endereco", "telefone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]